# 3DC's DDW Clinic

Part of SUTD Google DSC's Data Driven World Clinics 2022 for SUTD Students.


Exercises by Thao Vy Dinh

Notebook by Beckham Wee

References: Quantopian Lecture Series, pandas documentation

Dataset: Dr Ernest Chan

## Introduction to Pandas
pandas is a python library that provides tools to better manage data. We will be covering 'DataFrame' and 'Series' objects, both of which help in the process. This allows us to conduct statistical inferences/machine learning/data science much more easily.

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Series
A pandas `Series` is a 1-dimensional array with labels that can contain any data type.

#### Creating a `Series` 
as easy as calling `pandas.Series()` on a Python list or NumPy array.

In [9]:
# Called on a list or ndarray
s = pd.Series([1, 2, np.nan, 3, 4])

s

0    1.0
1    2.0
2    NaN
3    3.0
4    4.0
dtype: float64

#### Series' name
Every `Series` has a name. We can give the series a name as a parameter or we can define it afterwards by directly accessing the name attribute. For now, we haven't given our series a name.

In [10]:
print(s.name)

None

This name can be directly set (via their own setter method!)

In [12]:
s.name = "My exam results out of 100"

print(s.name)

My exam results out of 100

#### Index
We call the collected axis labels of a `Series` its index. An index can either passed to a `Series` as a parameter or added later. 
- If we didn't set it, a `Series` will simply contain an index composed of integers, starting at $0$.

In [15]:
print(s.index)

RangeIndex(start=0, stop=5, step=1)

We can set the index manually, again via their own setter method.

In [17]:
new_index = ['Modelling Uncertaininty', 'Bio', 'DDW', 'HASS', 'FCP']
s.index = new_index

print(s.index)
print(s)

Index(['Modelling Uncertaininty', 'Bio', 'DDW', 'HASS', 'FCP'], dtype='object')
Modelling Uncertaininty    1.0
Bio                        2.0
DDW                        NaN
HASS                       3.0
FCP                        4.0
Name: My exam results out of 100, dtype: float64

## DataFrames

`DataFrames` are 2-dimensional objects, unlike `Series` which are 1-dimensional. In other words, DataFrames have more than one column.
- Each `DataFrame` has an index and a columns attribute
- The index attribute is the same as the index of a `Series`
- Columns allow us to combine named columns (all `Series`), into a cohesive object. They will share the index.

#### Creating DataFrames

We can create a `DataFrame` by calling `pandas.DataFrame()` on a dictionary or NumPy `ndarray`. We can also concatenate a group of pandas `Series` into a `DataFrame` using `pandas.concat()`.

In [20]:
# Dictionary
dict_data = {
    'a' : [1, 2, 3, 4, 5],
    'b' : ['A', 'B', 'C', 'D', 'E'],
    'c' : ['3', 'D', 'C', 'IS', 'COOL']
}

We can also set the index directly.

In [22]:
# Method 1: Creating DataFrame using dictionaries or nparrays
df = pd.DataFrame(data=dict_data, index=['1st','2nd', '3rd', '4th', '5th'])
df

     a  b     c
1st  1  A     3
2nd  2  B     D
3rd  3  C     C
4th  4  D    IS
5th  5  E  COOL

By concatenating, we have to specificy an axis.

- `axis = 0` implies that we are adding the other Series as a row.
- `axis = 1` implies that we are applying this operation to the columns.

This is widely global for all methods in pandas.

In [26]:
# Method 2: Creating by combining series
s_1 = pd.Series([2, 4, 6, 8, 10], name='Evens')
s_2 = pd.Series([1, 3, 5, 7, 9], name="Odds")
numbers = pd.concat([s_1, s_2], axis=1)

numbers

   Evens  Odds
0      2     1
1      4     3
2      6     5
3      8     7
4     10     9

#### DataFrame Columns
Each `DataFrame` also has a `columns` attribute. These can either be assigned when we call `pandas.DataFrame` or they can be set.
- However, `using pd.concat()` basically sets the names for you.

In [28]:
# Can modify columns names just like that using a list
numbers.columns = ['DAMN ITS EVEN', 'DAMN ITS ODD']

numbers

   DAMN ITS EVEN  DAMN ITS ODD
0              2             1
1              4             3
2              6             5
3              8             7
4             10             9

#### Indexing
Refer to Series' indexing. Every column in a DataFrame shares the same index.

#### HACKS: Getting the values out FAST
You'll only know this if you attended the clinic

In [29]:
# numbers.values returns a np array
numbers.values

array([[ 2,  1],
       [ 4,  3],
       [ 6,  5],
       [ 8,  7],
       [10,  9]])

In [30]:
type(numbers.values)

numpy.ndarray

#### Accessing elements in DataFrame
In the real world, we need to be using DataFrames to get data, or manipulate them. Here's a practical example of stock data.

In [38]:
# Reading data here from excel
PEP = pd.read_excel('PEP.xls')
PEP.set_index('Date', inplace=True)

PEP.sort_index(inplace=True)

In [37]:
PEP

             Open   High    Low  Close    Volume  Adj Close
Date
1977-01-03  79.00  80.13  79.00  80.00   1085400       0.66
1977-01-04  80.00  80.25  78.88  79.00   3018600       0.65
1977-01-05  78.75  78.75  77.88  78.38   2246400       0.65
1977-01-06  78.63  79.00  78.63  78.75   1004400       0.65
1977-01-07  78.75  78.75  78.25  78.50    950400       0.65
...           ...    ...    ...    ...       ...        ...
2008-01-14  78.25  78.39  76.65  76.92   7762500      76.92
2008-01-15  76.02  76.55  74.71  74.83   9342100      74.83
2008-01-16  74.35  74.85  73.28  73.54   9636900      73.54
2008-01-17  73.70  73.70  71.84  72.10  10016800      72.10
2008-01-18  72.54  73.16  70.95  71.46   8986000      71.46

[7835 rows x 6 columns]

That's a lot of data... sometimes we just need a small segment of that.

We can do this either by directly accessing the attributes or by using `.iloc[]` and `.loc[]`.
- They both take in indices for row and columns

#### Method 1: iloc
Let's look at `iloc[]` first. It's used when we are only using INTEGER INDICES, just like an array. For example, we want to rows 1 to 50, as well as columns `Close` and `Volume`
- Rows 1 to 10 will be represented as `0:10`
- Close has an index of 3, Volume has an index of 4, hence `3:5`

In [46]:
example1 = PEP.iloc[0:10, 3:5]
print(example1.shape)
example1

(10, 2)

            Close   Volume
Date
1977-01-03  80.00  1085400
1977-01-04  79.00  3018600
1977-01-05  78.38  2246400
1977-01-06  78.75  1004400
1977-01-07  78.50   950400
1977-01-10  78.75  1641600
1977-01-11  77.75  1263600
1977-01-12  77.88  1063800
1977-01-13  78.75   766800
1977-01-14  78.00   394200

To get all rows, but only specific columns, we can just leave the row index as `:`
- we can do the same thing for columns

In [74]:
example1 = PEP.iloc[:, 3:5]
print(example1.shape)
example1

(7835, 2)

            Close    Volume
Date
1977-01-03  80.00   1085400
1977-01-04  79.00   3018600
1977-01-05  78.38   2246400
1977-01-06  78.75   1004400
1977-01-07  78.50    950400
...           ...       ...
2008-01-14  76.92   7762500
2008-01-15  74.83   9342100
2008-01-16  73.54   9636900
2008-01-17  72.10  10016800
2008-01-18  71.46   8986000

[7835 rows x 2 columns]

#### Method 2: loc
Lets look at `.loc[]` next. This is a special indexing method, whereby we can slice by column/row name, or even by boolean indexing.

Lets try to get similar data to above, but using loc instead.
- Rows are `1997-01-03` to `1997-01-14`
- Columns are `Close` and `Volume`

In [50]:
# Using integers
example2 = PEP.loc['1997-01-01':'1997-01-14', 'Close':'Volume']
example2

            Close   Volume
Date
1997-01-02  29.50  4237700
1997-01-03  29.75  2795500
1997-01-06  29.25  5361400
1997-01-07  29.50  4311600
1997-01-08  29.62  3346800
1997-01-09  29.25  4212900
1997-01-10  29.12  5606200
1997-01-13  29.50  3874100
1997-01-14  29.75  3561100

Want more specific columns? We can store column names and put them in an array, before using them in loc

In [53]:
colnames = ['Close', 'Open', 'Volume']
example2 = PEP.loc['1997-01-01':'1997-01-14', colnames]
example2

            Close   Open   Volume
Date
1997-01-02  29.50  30.00  4237700
1997-01-03  29.75  29.75  2795500
1997-01-06  29.25  29.88  5361400
1997-01-07  29.50  29.12  4311600
1997-01-08  29.62  29.62  3346800
1997-01-09  29.25  29.62  4212900
1997-01-10  29.12  28.88  5606200
1997-01-13  29.50  29.12  3874100
1997-01-14  29.75  29.50  3561100

#### Boolean Indexing
Sometimes, a small segment of data is great. But if you really want to get specific, we can use booleans in `.loc[]` to get VERY specific data, instead of just getting attributes via rows and columns.

For example, lets first get the data for the year 2000.

In [54]:
data = PEP.loc['2000-01-01':'2000-12-12', ['Close', 'Volume']]
data

            Close    Volume
Date
2000-01-03  36.88   5298400
2000-01-04  35.94   4555700
2000-01-05  35.06   5701900
2000-01-06  36.62   6863100
2000-01-07  37.62  10527800
...           ...       ...
2000-12-06  45.31   7443800
2000-12-07  46.94   6975800
2000-12-08  47.44   5436900
2000-12-11  47.06   4171700
2000-12-12  47.38   2542100

[240 rows x 2 columns]

We want to know the closing prices for the PEP stock on days whereby there is high volume. This is where boolean indexing comes in.

In [61]:
# By leaving columns only with a ':', we get all columns in the data
# As long as it fits our boolean
booleaned = data.loc[data['Volume'] > 6000000, :]
booleaned.head()

            Close    Volume
Date
2000-01-06  36.62   6863100
2000-01-07  37.62  10527800
2000-01-10  36.88   6402500
2000-02-09  34.00   8432500
2000-03-07  30.62   7053200

## Common Operations that I think will help you with projects
Quick hacks that only you would know if you came here today :)

#### 1. mean
`.mean(axis)`
- axis=1 implies that we are finding the mean of a row
- axis=0 implies that we are finding the mean of a column

In [64]:
# Mean by row
data.mean(axis=1)

Date
2000-01-06    3431568.310
2000-01-07    5263918.810
2000-01-10    3201268.440
2000-02-09    4216267.000
2000-03-07    3526615.310
2000-03-30    3425467.970
2000-05-10    4392219.595
2000-05-22    3212819.875
2000-06-13    3309921.405
2000-06-16    3022421.875
2000-06-30    4129072.220
2000-07-13    3081020.190
2000-08-16    3338022.000
2000-11-15    3445773.280
2000-11-17    3106571.970
2000-11-20    3324172.500
2000-11-21    3136073.250
2000-12-01    6050621.190
2000-12-04    6186471.905
2000-12-05    3309272.095
2000-12-06    3721922.655
2000-12-07    3487923.470
dtype: float64

Now lets find the mean by columns. In other words, this is the average price of PEP stock and average volume in the year 2000

In [72]:
# Mean by column
data.mean(axis=0)

Close     4.061946e+01
Volume    4.023941e+06
dtype: float64

#### 2. standard deviation
`.std(axis)`

Here we can get the standard deviation of a stock by columns. The standard deviation of a closing price also indicates its volatility!

In [73]:
data.std(axis=0)

Close     5.069496e+00
Volume    1.613522e+06
dtype: float64

#### 3. Correlation Coefficient

In [78]:
data.corr()

           Close    Volume
Close   1.000000 -0.088497
Volume -0.088497  1.000000

#### 4. Describing data

In [79]:
data.describe()

            Close        Volume
count  240.000000  2.400000e+02
mean    40.619458  4.023941e+06
std      5.069496  1.613522e+06
min     30.500000  1.400100e+06
25%     36.250000  2.987375e+06
50%     41.955000  3.734950e+06
75%     44.637500  4.654575e+06
max     49.120000  1.237290e+07

#### 5. Deleting a column

In [80]:
data.drop(columns=['Volume'])

            Close
Date
2000-01-03  36.88
2000-01-04  35.94
2000-01-05  35.06
2000-01-06  36.62
2000-01-07  37.62
...           ...
2000-12-06  45.31
2000-12-07  46.94
2000-12-08  47.44
2000-12-11  47.06
2000-12-12  47.38

[240 rows x 1 columns]

# END.
We hope that you've taken away some new knowledge today! To learn more about pandas, refer to the pandas documentation:
https://pandas.pydata.org/docs/